#include <iostream>

int main() {
    int годиниКурінняВДень, середнійТермінЖиття;

    std::cout << "Введіть кількість годин куріння на день: ";
    std::cin >> годиниКурінняВДень;

    std::cout << "Введіть середній термін життя (у роках): ";
    std::cin >> середнійТермінЖиття;

    int загальнийЧасКуріння = годиниКурінняВДень * 365 * середнійТермінЖиття;

    std::cout << "Загальний час, витрачений на куріння за життя: " << загальнийЧасКуріння << " годин\n";
    std::cout << "Загальний час, витрачений на куріння за життя: " << загальнийЧасКуріння / 24 << " днів\n";
    std::cout << "Загальний час, витрачений на куріння за життя: " << загальнийЧасКуріння / (24 * 365) << " років\n";

    return 0;
}
